-- 과목 테이블에 초기 데이터 삽입
INSERT INTO subject (round, subject_name, exam_date) VALUES
 (54, '국제무역사 1급', '2023-07-22'),
 (55, '국제무역사 1급', '2023-09-16'),
 (56, '국제무역사 1급', '2023-11-25'),
 (57, '국제무역사 1급', '2024-03-30'),
 (58, '국제무역사 1급', '2024-05-25'),
 (59, '국제무역사 1급', '2024-08-10'),
 (60, '국제무역사 1급', '2024-11-16');


-- 대과목 테이블에 초기 데이터 삽입
INSERT INTO major (major_name) VALUES
('무역규범'),
('무역결제'),
('무역계약'),
('무역영어');


-- 소과목 테이블에 초기 데이터 삽입
INSERT INTO minor (minor_name, major_id) VALUES
 ('대외무역법', 1),
 ('통관/관세환급', 1),
 ('FTA', 1),
 ('대금결제', 2),
 ('외환실무', 2),
 ('무역계약', 3),
 ('운송', 3),
 ('보험', 3),
 ('무역영어', 4),
 ('무역 관련 국제규범', 4),
 ('무역서식', 4);

